Rhino.Inside.Revit API
GeometryDecoder.ToCurve Method
Overload List
Name | Description
ToCurve(Arc)
 Converts the specified Autodesk.Revit.DB.Arc to an equivalent Rhino.Geometry.Curve.
ToCurve(Curve)
 Converts the specified Autodesk.Revit.DB.Curve to an equivalent Rhino.Geometry.Curve.
ToCurve(CurveLoop)
 Converts the specified Autodesk.Revit.DB.CurveLoop to an equivalent Rhino.Geometry.Curve.
ToCurve(CylindricalHelix)
 Converts the specified Autodesk.Revit.DB.CylindricalHelix to an equivalent Rhino.Geometry.Curve.
ToCurve(Ellipse)
 Converts the specified Autodesk.Revit.DB.Ellipse to an equivalent Rhino.Geometry.Curve.
ToCurve(HermiteSpline)
 Converts the specified Autodesk.Revit.DB.HermiteSpline to an equivalent Rhino.Geometry.Curve.
ToCurve(Line)
 Converts the specified Autodesk.Revit.DB.Line to an equivalent Rhino.Geometry.Curve.
ToCurve(NurbSpline)
 Converts the specified Autodesk.Revit.DB.NurbSpline to an equivalent Rhino.Geometry.Curve.
Top
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace